# Katalog B: Fundortverzeichnis (Anlage)

siehe Saev 2015:182--203 Anlage 1

In [3]:
%matplotlib inline
from IPython.display import display
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from mpl_toolkits.axes_grid1 import make_axes_locatable
import sqlite3

import sys, os
sys.path.append("/Python")
from myfunctions import *
from parula import *

con = sqlite3.connect("../data/CongoDB.sqlite")

In [4]:
sql = """SELECT
           't_Ort'.'Kat-Nr' AS 'Kat.-Nr.',
           t_Ort.ort_name AS Fundort, 
           t_Ort.y_lat AS 'Breite (WGS 84)',
           t_Ort.x_long AS 'Länge (WGS 84)'
       FROM t_Ort
       WHERE (((t_Ort.ort_lit) ='DS')
           AND ((t_Ort.ort_name) NOT LIKE '%?%')
           AND (('t_Ort'.'Kat-Nr') != ''))
       ORDER BY 't_Ort'.'Kat-Nr'""".replace('\n',' ')

df = pd.read_sql(sql, con)

df['Breite (WGS 84)'] = round(df['Breite (WGS 84)'], 4)
df['Länge (WGS 84)'] = round(df['Länge (WGS 84)'], 4)

df.to_latex('../output/tabs/Kat-B_Fundstellenverzeichnis.tex', longtable = True, escape = False, index=False)
df.head()

  Kat.-Nr.           Fundort  Breite (WGS 84)  Länge (WGS 84)
0      186  Bruxelles-Nganda          -0.3775         17.7205
1      187      Nsele-Nganda          -0.3580         17.7203
2      188           Lokekya          -0.2126         17.6824
3      189           Bobangi          -0.1089         17.7222
4      190          Bokwango           0.1028         17.7805

In [5]:
decimalDegrees2DMS(df.iloc[1]['Breite (WGS 84)'], 'Latitude')

"0º 21' 28.8'' "

In [6]:
sql = """SELECT
           't_Ort'.'Kat-Nr' AS 'Kat.-Nr.',
           t_Ort.ort_name AS Fundort, 
           t_Ort.y_lat AS 'Breite (WGS 84)',
           t_Ort.x_long AS 'Länge (WGS 84)'
       FROM t_Ort
       WHERE (((t_Ort.ort_lit) LIKE '%Wotzka%')
           AND ((t_Ort.ort_name) NOT LIKE '%?%')
           AND (('t_Ort'.'Kat-Nr') != ''))
       ORDER BY 't_Ort'.'Kat-Nr'""".replace('\n',' ')

df = pd.read_sql(sql, con)

df['Breite (WGS 84)'] = round(df['Breite (WGS 84)'], 4)
df['Länge (WGS 84)'] = round(df['Länge (WGS 84)'], 4)

df.to_latex('../output/tabs/Kat-B_Fundstellenverzeichnis_Wotzka1995.tex', longtable = True, escape = False, index=False)
df.head()

  Kat.-Nr.           Fundort  Breite (WGS 84)  Länge (WGS 84)
0        1  Bondongo-Losombo          -0.9833         18.7000
1       10          Mbandaka           0.0477         18.2562
2      100        Esangaonje          -0.4425         21.5521
3      101              Wema          -0.4797         21.6358
4      102             Nkoma          -0.5120         21.7524

In [10]:
sql = """SELECT
           't_Ort'.'Kat-Nr' AS 'Kat.-Nr.',
           t_Ort.ort_name AS Fundort, 
           t_Ort.y_lat AS 'Breite (WGS 84)',
           t_Ort.x_long AS 'Länge (WGS 84)'
       FROM t_Ort
       WHERE (((t_Ort.ort_lit) LIKE'%LivingstoneSmith.2017%')
           AND ((t_Ort.ort_name) NOT LIKE '%?%'))
       ORDER BY t_Ort.x_long""".replace('\n',' ')

df = pd.read_sql(sql, con)

df['Breite (WGS 84)'] = round(df['Breite (WGS 84)'], 4)
df['Länge (WGS 84)'] = round(df['Länge (WGS 84)'], 4)

df.to_latex('../output/tabs/Kat-B_Fundstellenverzeichnis_LivingstoneSmith.2017.tex', longtable = True, escape = False, index=False)
df.head()

  Kat.-Nr.        Fundort  Breite (WGS 84)  Länge (WGS 84)
0     None      Engengele           2.0939         22.6722
1     None         Moenge           2.0501         22.8649
2     None  Bomane Yangwa           1.3028         23.8174
3     None  Yantshambi II           0.7255         24.2184
4     None    Ilambi Moke           0.6494         24.2304